# DifferentOffsets Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..DifferentOffsets Property
BuiltInFailures..::..SketchFailures Class See Also
---
Adjacent slope-defining lines must have identical eave heights; the highlighted lines do not. You can use the Align Eaves tool to have the eaves aligned for you.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DifferentOffsets { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DifferentOffsets As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DifferentOffsets {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace